// DOM-дерево

// Основой HTML-докумета являются теги.

// В соответствии с объектной моделью документа(DOM), каждый HTML-тег является объектом. Вложенные теги являются "детьми" родительского элемента. Текст, который находится внутри тега, также является объектом.

// Например, document.body - объект для тега <body>.

// document.body.style.background = 'red'; // сделать фон красным

// setTimeout(() => document.body.style.background = '', 3000); // вернуть назад





































